###############################################################
#  Generated by:      Cadence Innovus 17.11-s080_1
#  OS:                Linux x86_64(Host ID ee13)
#  Generated on:      Mon Dec 30 01:15:28 2019
#  Design:            CHIP
#  Command:           saveDesign DBS/CHIP.inn
###############################################################
current_design CHIP
create_clock [get_ports {clk}]  -name clk -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  0.05  [get_ports {out_valid}]
set_load -pin_load -min  0.05  [get_ports {out_valid}]
set_load -pin_load -max  0.05  [get_ports {out[7]}]
set_load -pin_load -min  0.05  [get_ports {out[7]}]
set_load -pin_load -max  0.05  [get_ports {out[6]}]
set_load -pin_load -min  0.05  [get_ports {out[6]}]
set_load -pin_load -max  0.05  [get_ports {out[5]}]
set_load -pin_load -min  0.05  [get_ports {out[5]}]
set_load -pin_load -max  0.05  [get_ports {out[4]}]
set_load -pin_load -min  0.05  [get_ports {out[4]}]
set_load -pin_load -max  0.05  [get_ports {out[3]}]
set_load -pin_load -min  0.05  [get_ports {out[3]}]
set_load -pin_load -max  0.05  [get_ports {out[2]}]
set_load -pin_load -min  0.05  [get_ports {out[2]}]
set_load -pin_load -max  0.05  [get_ports {out[1]}]
set_load -pin_load -min  0.05  [get_ports {out[1]}]
set_load -pin_load -max  0.05  [get_ports {out[0]}]
set_load -pin_load -min  0.05  [get_ports {out[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[2]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_valid_w1}]
set_input_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[6]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[4]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_valid_d}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[2]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_valid_w2}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[7]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[7]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[5]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[7]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[5]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[3]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[5]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[3]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[1]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[3]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[1]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[1]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[7]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[5]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[3]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_valid_t}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight2[1]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[6]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[6]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[4]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[6]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[4]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {weight1[2]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {target[4]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {data_point[2]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[4]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[2]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[0]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[7]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[5]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[3]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[1]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_valid}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out[6]}]
